---
kind: property
id: P:Autodesk.Revit.DB.BeamSystem.BeamType
source: html/c1f1e42c-b564-b968-6632-a014104b4877.htm
---
# Autodesk.Revit.DB.BeamSystem.BeamType Property

Retrieves or changes the Beam Type of the BeamSystem.

## Syntax (C#)
```csharp
public FamilySymbol BeamType { get; set; }
```